{
  "project": "Grafana",
  "branchName": "ralph/explore-variables",
  "description": "Add template variables support to Grafana Explore, allowing users to create custom variables with multiple values and use them in ad-hoc queries. Replace the MVP simple dialog with the full variable editor UI from Dashboard settings.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add explore variables state management",
      "description": "As a developer, I need a state structure in the Explore pane to store user-defined variables so that other components can read and update them.",
      "acceptanceCriteria": [
        "Add a 'variables' array to the Explore pane state, each variable having: name (string), values (string[]), and selectedValue (string)",
        "Create Redux actions: addVariable, removeVariable, updateVariableSelectedValue",
        "addVariable initializes selectedValue to the first value in the values array",
        "State is scoped per Explore pane (left/right split)",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Explore pane state lives in public/app/features/explore/state/. Look at ExploreItemState for the existing pane state shape. Add a new slice or extend the existing reducers."
    },
    {
      "id": "US-002",
      "title": "Add 'Add variable' button and creation dialog to Explore toolbar",
      "description": "As a user, I want to click an 'Add variable' button in the Explore toolbar to open a dialog where I can define a variable name and its values.",
      "acceptanceCriteria": [
        "An 'Add variable' button appears in ExploreToolbar after the 'Go queryless' / ToolbarExtensionPoint area",
        "Button uses the plus icon and secondary/outline variant, matching the '+ Add query' button style",
        "Clicking the button opens a dialog/modal with inputs for: variable name (text input) and variable values (ability to add multiple string values including empty string)",
        "Submitting the dialog dispatches the addVariable action and closes the dialog",
        "Dialog has proper validation: name is required, at least one value is required",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "ExploreToolbar is at public/app/features/explore/ExploreToolbar.tsx. Use @grafana/ui components (Modal, Button, Input, Field) for the dialog. Look at how '+ Add query' button is styled in QueryGroup.tsx for reference."
    },
    {
      "id": "US-003",
      "title": "Display variable selector dropdowns in Explore toolbar",
      "description": "As a user, I want to see a dropdown selector for each variable I created in the toolbar so that I can pick which value to use in my queries.",
      "acceptanceCriteria": [
        "Each variable in state renders as a labeled dropdown in the toolbar row, after the 'Add variable' button",
        "Dropdown shows all values defined for that variable",
        "The currently selected value is shown in the dropdown",
        "Changing the dropdown selection dispatches updateVariableSelectedValue",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Use @grafana/ui Select component for the dropdown. Render variable selectors as part of ExploreToolbar or a new child component."
    },
    {
      "id": "US-004",
      "title": "Interpolate explore variables into queries and auto-refresh on change",
      "description": "As a user, I want my explore variables (e.g. $job) to be replaced with their selected value in all queries, and queries should automatically re-run when I change a variable's value.",
      "acceptanceCriteria": [
        "Explore variables are passed as scopedVars to buildQueryTransaction() when running queries",
        "Variable references like $job or ${job} in query text are replaced with the selected value at query time",
        "Changing a variable's selected value automatically triggers runQueries() to re-execute all queries in the pane",
        "Multiple variables can be used simultaneously in the same query",
        "Typecheck passes",
        "Verify in browser using dev-browser skill: go to Explore, add a variable 'job' with values 'demo' and 'node', write a query using $job, verify the variable value is interpolated, change the value and verify queries re-run"
      ],
      "priority": 4,
      "passes": true,
      "notes": "buildQueryTransaction() in public/app/core/utils/explore.ts already accepts scopedVars. Convert explore variables to ScopedVars format ({[name]: {text: value, value: value}}) and pass them through. For auto-refresh, watch for variable changes in the component or use a useEffect that triggers runQueries when selectedValue changes. The template service (getTemplateSrv()) handles the actual $var interpolation - variables in scopedVars are checked first during replacement."
    },
    {
      "id": "US-005",
      "title": "Migrate explore variables state from Redux ExploreVariable[] to SceneVariableSet",
      "description": "As a developer, I need to replace the simple Redux ExploreVariable[] state with Grafana Scenes SceneVariableSet so that we can reuse the dashboard variable editor components which require SceneVariable instances.",
      "acceptanceCriteria": [
        "ExploreItemState in public/app/types/explore.ts replaces 'variables: ExploreVariable[]' with a SceneVariableSet reference. The ExploreVariable interface is removed.",
        "makeExplorePaneState() in public/app/features/explore/state/utils.ts initializes a new SceneVariableSet({ variables: [] }) per pane",
        "state/variables.ts is rewritten: addVariable creates a CustomVariable (from @grafana/scenes) in the SceneVariableSet with the provided name and values, removeVariable removes a variable from the set by name",
        "state/query.ts ScopedVars construction (around lines 561-565) reads from SceneVariableSet using variable.getValue() and variable.getValueText() instead of simple ExploreVariable fields",
        "Subscribe to SceneVariableValueChangedEvent on the SceneVariableSet to dispatch runQueries() automatically when any variable value changes",
        "ExploreToolbar reads variables from SceneVariableSet state and renders Select dropdowns using SceneVariable.useState()",
        "The 'Add variable' button temporarily creates CustomVariable instances (will be replaced by full editor in US-006)",
        "Existing behavior preserved: adding variables, selecting values, query interpolation, and auto-refresh all still work",
        "Typecheck passes",
        "Verify in browser using dev-browser skill: same test as US-004 acceptance criteria (add variable, use in query, change value, verify auto-refresh)"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Key imports: SceneVariableSet, CustomVariable, SceneVariableValueChangedEvent from @grafana/scenes. Use getVariableScene() from public/app/features/dashboard-scene/settings/variables/utils.ts to create SceneVariable instances. For ScopedVars conversion, iterate variableSet.state.variables and use v.getValue()/v.getValueText(). The subscription to SceneVariableValueChangedEvent should be set up when the pane initializes. The AddVariableDialog.tsx can stay temporarily — just adapt it to create CustomVariable instances in the SceneVariableSet instead of dispatching the old addVariableAction."
    },
    {
      "id": "US-006",
      "title": "Create Drawer-based variable editor with VariableEditorForm",
      "description": "As a user, I want to create variables using the rich editor UI from Dashboard settings, with a full configuration form presented in a side Drawer. Only custom variables are supported.",
      "acceptanceCriteria": [
        "Create ExploreVariableEditor component that renders a Drawer (from @grafana/ui, size md) with two views: editor form and list view",
        "Clicking 'Add variable' in the toolbar opens the Drawer showing the editor form for a new CustomVariable",
        "The editor form reuses VariableEditorForm from public/app/features/dashboard-scene/settings/variables/VariableEditorForm.tsx, passing the CustomVariable instance directly",
        "The editor form shows: name/label/description fields, CustomVariableEditor (values textarea, multi-value/include-all/allow custom values toggles), and values preview",
        "The variable type selector dropdown is hidden (only custom type is supported)",
        "'Back to list' or closing the Drawer saves the variable (adds it to the SceneVariableSet)",
        "Delete AddVariableDialog.tsx as it is no longer needed",
        "Typecheck passes",
        "Verify in browser using dev-browser skill: click Add variable, see full editor form with values textarea, create variable, verify it appears in toolbar"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Import VariableEditorForm from public/app/features/dashboard-scene/settings/variables/VariableEditorForm.tsx. It takes props: variable (SceneVariable), onTypeChange, onGoBack, onDelete. Since only custom type is supported, hide the type selector dropdown. The Drawer component from @grafana/ui accepts title, onClose, size props. Use a local React state (e.g. 'view': 'editor' | 'list') to manage the Drawer content transitions."
    },
    {
      "id": "US-007",
      "title": "Add variable list view in Drawer for editing and deleting variables",
      "description": "As a user, I want a list view in the Drawer showing all my variables so I can edit or delete them.",
      "acceptanceCriteria": [
        "When the Drawer opens and there are existing variables, show a list view first (ExploreVariableListView component)",
        "The list view shows each variable's name and definition summary (reuse getDefinition() from dashboard-scene utils.ts)",
        "Each row in the list has an edit button and a delete button",
        "A 'New variable' button at the bottom of the list opens the editor form for a new variable",
        "Clicking edit on a list row opens the editor form for that variable",
        "The editor allows changing name, label, description, values, and custom variable settings",
        "The Delete button in the editor shows a confirmation modal (reuse ConfirmModal from @grafana/ui)",
        "Confirming delete removes the variable from the SceneVariableSet, closes the editor, and the toolbar dropdown disappears",
        "Typecheck passes",
        "Verify in browser using dev-browser skill: create a variable, open Drawer, see list view, click edit, see editor pre-filled, edit values, verify changes apply, delete variable, verify it disappears"
      ],
      "priority": 7,
      "passes": true,
      "notes": "For the list view, create ExploreVariableListView.tsx in public/app/features/explore/Variables/. Reference VariableEditorList.tsx from dashboard-scene for the pattern, but simplify: no drag-and-drop reordering needed. Use getDefinition() from public/app/features/dashboard-scene/settings/variables/utils.ts for the definition column."
    },
    {
      "id": "US-008",
      "title": "Unit tests for explore variable state management",
      "description": "As a developer, I want comprehensive unit tests for the SceneVariableSet-based state management to ensure CustomVariable instances are correctly created, removed, converted to ScopedVars, and trigger query re-runs.",
      "acceptanceCriteria": [
        "Create test file public/app/features/explore/state/variables.test.ts",
        "Test: new explore pane initializes with an empty SceneVariableSet",
        "Test: adding a CustomVariable to the set with values 'a,b,c'",
        "Test: auto-generated names are unique (custom0, then custom1)",
        "Test: removing a variable by name from the set",
        "Test: removing a non-existent variable is a no-op",
        "Test: converting SceneVariableSet to ScopedVars produces correct format { name: { text, value } }",
        "Test: converting empty set produces empty ScopedVars",
        "Test: multiple variables produce multiple ScopedVars entries",
        "Test: SceneVariableValueChangedEvent fires when a variable value changes",
        "All tests pass",
        "Typecheck passes"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Look at existing test patterns in public/app/features/explore/state/main.test.ts and query.test.ts for how to test explore reducers and thunks. Use reducerTester and thunkTester where applicable. For SceneVariable tests, instantiate variables directly: new CustomVariable({ name: 'test', query: 'a,b,c' }). For ScopedVars conversion, extract the conversion logic into a testable function."
    },
    {
      "id": "US-009",
      "title": "Component tests for variable editor UI",
      "description": "As a developer, I want comprehensive component tests for the editor Drawer and variable list view to ensure the UI renders correctly and handles user interactions.",
      "acceptanceCriteria": [
        "Create test file public/app/features/explore/Variables/ExploreVariableEditor.test.tsx",
        "Test: clicking 'Add variable' opens the Drawer with the editor form",
        "Test: Drawer close button closes it",
        "Test: a new CustomVariable is instantiated when creating a new variable",
        "Test: VariableEditorForm renders for a CustomVariable",
        "Test: variable type selector is hidden",
        "Test: name validation shows error for '__' prefix names",
        "Test: name validation shows error for duplicate names",
        "Test: 'Back to list' navigates back to list view",
        "Test: delete button shows confirmation modal",
        "Test: list view shows existing variables with name and definition",
        "Test: list view empty state shows 'Add variable' call-to-action",
        "All tests pass",
        "Typecheck passes"
      ],
      "priority": 9,
      "passes": true,
      "notes": "Use React Testing Library with @testing-library/react and @testing-library/user-event. For rendering components that use SceneVariable, create test fixtures with new CustomVariable({ name: 'test', query: 'a,b,c' }) wrapped in a SceneVariableSet. Mock the Drawer component if needed, or use it directly. Reference existing component tests in public/app/features/dashboard-scene/settings/variables/ for patterns."
    },
    {
      "id": "US-010",
      "title": "Integration tests for variable interpolation and toolbar",
      "description": "As a developer, I want integration tests verifying that custom variables are correctly interpolated into queries, that query re-runs trigger on value changes, and that toolbar dropdowns work end-to-end.",
      "acceptanceCriteria": [
        "Create test file public/app/features/explore/spec/variables.test.ts",
        "Test: create a custom variable with values ['foo', 'bar'], select 'foo', verify ScopedVars contains { varName: { text: 'foo', value: 'foo' } }",
        "Test: changing a variable value dispatches runQueries with updated ScopedVars",
        "Test: variables in one split pane do not affect the other pane",
        "Test: deleting a variable removes it from ScopedVars and triggers query re-run",
        "Test: toolbar Select dropdown shows variable's computed options",
        "Test: toolbar Select prefix shows $variableName",
        "Test: selecting a value in toolbar dropdown updates the variable",
        "Test: 'Manage variables' button opens Drawer to list view when variables exist",
        "Test: variable with empty custom values renders dropdown with no options without crashing",
        "Test: rapid value changes do not cause stale query results",
        "All tests pass",
        "Typecheck passes"
      ],
      "priority": 10,
      "passes": true,
      "notes": "Use the setupExplore helper from public/app/features/explore/spec/helper/setup.ts for integration tests. For toolbar tests, render the ExploreToolbar with a configured SceneVariableSet in the Redux store. For query interpolation tests, mock the datasource and verify ScopedVars in the query transaction. Reference public/app/features/explore/spec/interpolation.test.tsx for existing interpolation test patterns."
    },
    {
      "id": "US-011",
      "title": "Replace 'dashboard' references with 'explore' in variable editor Drawer",
      "description": "As a user, I should not see any mention of 'dashboard' in the Explore variable editor Drawer. Since the editor reuses components from the dashboard variable editor, any dashboard-specific text must be overridden with Explore-appropriate wording.",
      "acceptanceCriteria": [
        "No user-visible text in the Drawer (editor form, list view) contains the word 'dashboard'",
        "Typecheck passes"
      ],
      "priority": 11,
      "passes": true,
      "notes": "Check all user-visible text in the Drawer for 'dashboard' references and override with Explore-appropriate wording."
    },
    {
      "id": "US-012",
      "title": "Replace gear icons with Manage variables button",
      "description": "As a user, I want a single 'Manage variables' button in the toolbar instead of individual gear icons on each variable dropdown, so that variable management has a clear, centralized entry point.",
      "acceptanceCriteria": [
        "When no variables exist, the toolbar shows '+ Add variable' button (unchanged behavior)",
        "When variables exist, '+ Add variable' is replaced by a '(gear) Manage variables' button",
        "Individual gear icons on each variable dropdown are removed",
        "Clicking 'Manage variables' opens the Drawer to the list view (showing all variables)",
        "Clicking '+ Add variable' (when no variables) opens the Drawer to the editor form for a new variable (unchanged behavior)",
        "After deleting the last variable, the button reverts from 'Manage variables' back to '+ Add variable'",
        "Update component tests in ExploreToolbar.test.tsx: verify button text switches based on variable count, verify no per-variable gear icons",
        "Update integration tests in spec/variables.test.ts: replace gear icon test with 'Manage variables' button test",
        "Typecheck passes",
        "All existing tests updated and passing"
      ],
      "priority": 12,
      "passes": true,
      "notes": "In ExploreToolbar.tsx, check the SceneVariableSet length to decide which button to render. Use IconButton with name='cog' for the Manage variables variant. Remove the per-variable IconButton gear icons that were added in US-007. The Drawer opening logic should set the initial view to 'list' when opened via Manage variables, and 'editor' (for a new CustomVariable) when opened via Add variable."
    },
    {
      "id": "US-013",
      "title": "Persist variable state in URL",
      "description": "As a user, I want my explore variables (full configuration and selected values) to be persisted in the URL so that they survive page refresh and can be shared via copy-paste.",
      "acceptanceCriteria": [
        "Variable configuration is serialized to the URL: name, label, description, values, multi-value/include-all/allow custom values settings, and currently selected value(s)",
        "Variables are restored from URL on page load: SceneVariableSet is populated with correct CustomVariable instances from URL state",
        "URL updates when a variable is added, edited, or deleted",
        "URL updates when a variable's selected value changes",
        "Split view: each pane's variables are independently stored in the URL (scoped by pane ID in the existing panes structure)",
        "URL sharing works: copy URL with variables → paste in new tab → variables and selected values are fully restored",
        "Page refresh preserves all variables and selected values",
        "Backwards compatible: URLs without variables field load normally with an empty SceneVariableSet",
        "Malformed variables field in URL does not crash (graceful fallback to empty set)",
        "Add URL persistence tests in public/app/features/explore/hooks/useStateSync/: serialization, deserialization, URL update triggers, split view isolation",
        "Typecheck passes",
        "All tests pass"
      ],
      "priority": 13,
      "passes": true,
      "notes": "Key files: toURL.ts (add variable actions to sync predicate), external.utils.ts (add 'variables' to getUrlStateFromPaneState), migrators/v1.ts (parse 'variables' field), fromURL.ts (restore variables from URL). Add a 'variables' field to ExploreUrlState. Serialize each CustomVariable as a plain object with name, label, description, values, settings, and selected value. Deserialize back to CustomVariable instances on page load. Subscribe to variable changes to trigger URL sync."
    },
    {
      "id": "US-014",
      "title": "Review and fix acceptance criteria for updated user stories",
      "description": "US-006 through US-011 were modified to remove multi-type variable support (only custom variables now) and remove per-variable gear icons. Since these stories are marked as passes: true, the existing code may not match the updated acceptance criteria. Review each story's code against its new criteria and fix any discrepancies.",
      "acceptanceCriteria": [
        "US-006: ExploreVariableEditor opens directly to editor form (no type selection step). Variable type selector dropdown is hidden. ExploreVariableTypeSelection component is removed or unused.",
        "US-007: List view shows variable name and definition (no 'type' column). 'New variable' button opens editor form directly (not type selection). No constant variable special handling. No per-variable gear icons in toolbar.",
        "US-008: Tests only cover CustomVariable (remove QueryVariable, TextBoxVariable, ConstantVariable tests). Auto-generated name tests use custom0/custom1. Remove type change tests.",
        "US-009: Remove ExploreVariableTypeSelection.test.tsx or its test cases. Remove tests for QueryVariable/TextBoxVariable/ConstantVariable rendering. Remove type selection transition tests. Add test that type selector is hidden.",
        "US-010: Remove textbox/constant variable integration tests. Remove gear icon test. Add 'Manage variables' button test.",
        "US-011: Remove type card description override logic (no type cards exist). Verify no 'dashboard' text remains in Drawer.",
        "All tests pass",
        "Typecheck passes"
      ],
      "priority": 14,
      "passes": true,
      "notes": "This is a cleanup story. Walk through each modified story's acceptance criteria, compare against the actual code, and fix mismatches. The key changes are: (1) only custom variables, no type selection, (2) type selector hidden in editor form, (3) no per-variable gear icons, (4) tests updated to match. Do NOT change stories US-001 through US-005 — those are unchanged."
    },
    {
      "id": "US-016",
      "title": "Enable custom values in variable selector dropdowns",
      "description": "As a user, I want to type custom values directly into the variable dropdown in the toolbar, so I can use values not in the predefined list without editing the variable configuration.",
      "acceptanceCriteria": [
        "New variables default to allowCustomValue: true",
        "The toolbar Select dropdown passes allowCustomValue from the variable state to the Select component",
        "When allowCustomValue is true, users can type a custom value in the dropdown and press Enter to use it",
        "Custom values are correctly interpolated into queries and trigger query re-run",
        "Custom values survive URL persistence: copy URL with a custom value selected, paste in new tab, the dropdown shows the custom value (not 'Choose')",
        "The 'Allow custom values' checkbox in the variable editor controls the behavior",
        "All tests pass",
        "Typecheck passes"
      ],
      "priority": 16,
      "passes": true,
      "notes": "The infrastructure was already fully in place (CustomVariable.state.allowCustomValue, Select allowCustomValue prop, URL serialization). The changes were: (1) pass allowCustomValue to Select in ExploreVariableSelectCustom, (2) set allowCustomValue: true when creating new CustomVariable instances, (3) ensure custom values not in the predefined options list are appended to the select options so they display correctly after URL restore."
    },
    {
      "id": "US-017",
      "title": "Match Explore variable selector UI to Dashboard variable selector",
      "description": "As a user, I want the variable selector dropdowns in Explore to look the same as they do in Dashboards, with a colored label and shared border effect.",
      "acceptanceCriteria": [
        "Variable selectors use ControlsLabel from @grafana/scenes for the label (colored background, shared border)",
        "Variable selectors use variable.Component from Scenes framework for the dropdown (MultiOrSingleValueSelect)",
        "Container styling matches dashboard VariableControls: inline-flex, shared border via removed left border-radius on second child",
        "Query re-run is triggered via SceneVariableValueChangedEvent subscription instead of manual dispatch",
        "All existing tests pass with updated assertions (label shows variable name without $ prefix)",
        "Typecheck passes"
      ],
      "priority": 17,
      "passes": true,
      "notes": "Replaced ExploreVariableSelectCustom and ExploreVariableSelectGeneric with a single ExploreVariableSelector using ControlsLabel + variable.Component pattern from dashboard-scene/scene/VariableControls.tsx."
    }
  ]
}
